app/views/comments/_comment.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<div id="<%= dom_id(comment) %>">
    <b><%= User.find(comment.user_id).email%></b>: