app/views/notifications/_notification.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <td>
    <%= User.find(notification.user_id).email%>