app/views/notifications/show.html.erb

<% if !@notification.seen && @notification.email==current_user.email %>
  <% new_Notification = Notification.find(@notification.id) %>
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  <% new_Notification.seen = true %>
  <% new_Notification.save %>
---
UPDATE "notifications" SET "updated_at" = $1, "seen" = $2 WHERE "notifications"."id" = $3  [["updated_at", "2022-05-24 13:43:05.200268"], ["seen", true], ["id", 1]]