app/controllers/comments_controller.rb

    def create
        @notification.comments.create! params.required(:comment).permit(:content,:user_id)
---
INSERT INTO "comments" ("notification_id", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["notification_id", 2], ["content", "234234"], ["created_at", "2022-05-24 14:42:40.903385"], ["updated_at", "2022-05-24 14:42:40.903385"], ["user_id", 1]]

        def set_notification
            @notification = Notification.find(params[:notification_id])
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]