app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications"
---
  def index
    @notifications = Notification.all

UPDATE "notifications" SET "updated_at" = $1 WHERE "notifications"."id" = $2  [["updated_at", "2022-05-24 08:21:38.467401"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @notification.update(notification_params)