app/controllers/notifications_controller.rb

  def index
    @notifications_received = Notification.where(email: current_user.email)
    @notifications_sent = Notification.where(user_id: current_user.id)
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."email" = $1 ORDER BY created_at DESC  [["email", "piet@test.com"]]
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]

  def create
    @notification = Notification.new(notification_params)
    @notification.user_id = current_user.id

    respond_to do |format|
      if @notification.save
---
INSERT INTO "notifications" ("title", "description", "created_at", "updated_at", "user_id", "email", "seen") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @notification.update(notification_params)
---
UPDATE "notifications" SET "updated_at" = $1 WHERE "notifications"."id" = $2  [["updated_at", "2022-05-24 14:46:41.169551"], ["id", 1]]

  def destroy
    @notification.destroy
---
DELETE FROM "notifications" WHERE "notifications"."id" = $1  [["id", 1]]

    def set_notification
      @notification = Notification.find(params[:id])
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]